# language: ru
Функциональность: Регистрация заявления о смерти

  @ui
  Сценарий: Успешная регистрация заявления о смерти
    Допустим заявитель авторизовался,находится на главной странице
    Когда заявитель нажимает кнопку Войти как пользователь
    И заполняет форму данные заявителя и нажимает кнопку далее
    И выбирает услугу "Регистрация смерти" нажатием кнопки
    И заполняет форму данные гражданина и нажимает кнопку далее
    И заполняет форму данные услуги и отправляет заявление нажатием кнопки завершить
    Тогда отображается сообщение "Спасибо за обращение!"